{
  "backend/main.mo": "Motoko canister implementing products, carts, orders, and user profiles with access control and various query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short predefined summaries for all frontend files.",
  "frontend/index.css": "Tailwind base layer defining global OKLCH color variables and dark mode overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining all storefront routes within a themed layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to submit their name and save their profile.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard component that blocks access to protected pages and prompts login when needed.",
  "frontend/src/components/cart/CartItemRow.tsx": "Renders a cart item row with quantity controls, price display, and remove button, updating quantities via callbacks.",
  "frontend/src/components/layout/Footer.tsx": "Displays a simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Provides the site header with navigation, cart icon with count, login controls, and a mobile menu.",
  "frontend/src/components/layout/StoreLayout.tsx": "Wraps the page with a header, footer, and main content outlet.",
  "frontend/src/components/products/ProductCard.tsx": "Shows a product card with image, title, price, and a link to view details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login methods, and context provider setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for products, cart, checkout, orders, and user profiles using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables and theme support for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AccountOrdersPage.tsx": "Displays a user's past orders with loading states and navigation to individual order details.",
  "frontend/src/pages/CartPage.tsx": "Shows cart contents, allows quantity updates and item removal, and calculates subtotal before checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow, shows order summary, and submits order creation with success or error handling.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays confirmation details for a completed order, including items and total, with navigation options.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Shows detailed information for a specific order, including product data and timestamps.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays product details, image, and description, and supports selecting quantity and adding to cart.",
  "frontend/src/pages/ProductListPage.tsx": "A React page that fetches products, applies client-side sorting, handles loading and error states, and renders a product list with a hero banner and profile setup modal.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme styles, colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing goals, features, requirements, architecture notes, and image requirements for an e‑commerce application."
}